webService/enviarDocumento.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.2 git-revision#3d0bba4. --><!-- Generated by JAX-WS RI (https://github.com/eclipse-ee4j/metro-jax-ws). RI's version is JAX-WS RI 2.3.2 git-revision#3d0bba4. --><definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://wsenviardocumento.webservice.dispapeles.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="http://wsenviardocumento.webservice.dispapeles.com/" name="enviarDocumento">
<types>
<xsd:schema>
<xsd:import namespace="http://wsenviardocumento.webservice.dispapeles.com/" schemaLocation="enviarDocumento_0663dfa8808611a56529c6143f583e1d.xsd"/>
</xsd:schema>
</types>
<message name="enviarDocumento">
<part name="parameters" element="tns:enviarDocumento"/>
</message>
<message name="enviarDocumentoResponse">
<part name="parameters" element="tns:enviarDocumentoResponse"/>
</message>
<portType name="WsEnviarDocumento">
<operation name="enviarDocumento">
<input wsam:Action="http://wsenviardocumento.webservice.dispapeles.com/WsEnviarDocumento/enviarDocumentoRequest" message="tns:enviarDocumento"/>
<output wsam:Action="http://wsenviardocumento.webservice.dispapeles.com/WsEnviarDocumento/enviarDocumentoResponse" message="tns:enviarDocumentoResponse"/>
</operation>
</portType>
<binding name="WsEnviarDocumentoPortBinding" type="tns:WsEnviarDocumento">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="enviarDocumento">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
</binding>
<service name="enviarDocumento">
<port name="WsEnviarDocumentoPort" binding="tns:WsEnviarDocumentoPortBinding">
<soap:address location="https://dispafac.com:443/DFFacturaElectronicaEnviarDocumentos/enviarDocumento"/>
</port>
</service>
</definitions>