config/SETT 20.txt

WS-DEBUG (Send)
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Body>
		<fjs1:enviarDocumento xmlns:fjs1="http://wsenviardocumento.webservice.dispapeles.com/">
			<felCabezaDocumento>
				<aplicafel>NO</aplicafel>
				<cantidadLineas>1</cantidadLineas>
				<codigoPlantillaPdf>14</codigoPlantillaPdf>
				<consecutivo>20</consecutivo>
				<contrasenia>Pwc0mf40r1ent3</contrasenia>
				<fechafacturacion>2022-08-02T11:03:10.00000-05:00</fechafacturacion>
				<idEmpresa>488</idEmpresa>
				<listaAdquirentes>
					<ciudad>54001</ciudad>
					<codigoCiudad>54001</codigoCiudad>
					<codigoPostal>540001</codigoPostal>
					<departamento>54</departamento>
					<digitoverificacion>9</digitoverificacion>
					<direccion>CL 19N 15BE 36 BRR SANTA HELENA</direccion>
					<nombreCompleto>JESUS HEMEL ALVAREZ ORTIZ</nombreCompleto>
					<numeroIdentificacion>88149417</numeroIdentificacion>
					<pais>CO</pais>
					<paisnombre>Colombia</paisnombre>
					<tipoIdentificacion>31</tipoIdentificacion>
					<tipoPersona>2</tipoPersona>
					<tipoobligacion>R-99-PN</tipoobligacion>
				</listaAdquirentes>
				<listaDetalle>
					<cantidad>1.0</cantidad>
					<codigoproducto>00063</codigoproducto>
					<listaCamposAdicionales>
						<fecha>2022-08-02T11:03:10.00000-05:00</fecha>
						<nombreCampo>PERIODO_FACTURACION</nombreCampo>
						<orden>0</orden>
						<seccion>0</seccion>
						<valorCampo>1</valorCampo>
					</listaCamposAdicionales>
					<muestracomercial>0</muestracomercial>
					<muestracomercialcodigo>0</muestracomercialcodigo>
					<nombreProducto>RECREACIONISTA DE ACTIVIDADES DEL SERVICIO</nombreProducto>
					<posicion>1</posicion>
					<preciosinimpuestos>3655400.0</preciosinimpuestos>
					<preciototal>3655400.0</preciototal>
					<tamanio>1.0</tamanio>
					<tipoImpuesto>3</tipoImpuesto>
					<tipocodigoproducto>999</tipocodigoproducto>
					<unidadmedida>94</unidadmedida>
					<valorUnitarioPorCantidad>3655400.0</valorUnitarioPorCantidad>
					<valorunitario>3655400.0</valorunitario>
				</listaDetalle>
				<listaMediosPagos>
					<medioPago>45</medioPago>
				</listaMediosPagos>
				<pago>
					<codigoMonedaCambio>COP</codigoMonedaCambio>
					<moneda>COP</moneda>
					<pagoanticipado>0.0</pagoanticipado>
					<periododepagoa>0</periododepagoa>
					<redondeoTotalFactura>0.0</redondeoTotalFactura>
					<subtotal>0.0</subtotal>
					<tipocompra>1</tipocompra>
					<totalCargos>0.0</totalCargos>
					<totalDescuento>0.0</totalDescuento>
					<totalbaseconimpuestos>3655400.0</totalbaseconimpuestos>
					<totalbaseimponible>3655400.0</totalbaseimponible>
					<totalfactura>3655400.0</totalfactura>
					<totalfacturaTotalParcial>0.0</totalfacturaTotalParcial>
					<totalimportebruto>3655400.0</totalimportebruto>
					<trm>0.0</trm>
					<trm_alterna>0.0</trm_alterna>
				</pago>
				<prefijo>SETT</prefijo>
				<tipoOperacion>10</tipoOperacion>
				<tipodocumento>7</tipodocumento>
				<tiponota>0</tiponota>
				<token>eaab450239c82b4efb6a0a894583d7aa5ffe886c</token>
				<usuario>EmpCOMFAORIENTE</usuario>
				<version>14</version>
			</felCabezaDocumento>
		</fjs1:enviarDocumento>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
WS-DEBUG END